week6/w6d2/sandwichr-master/app/controllers/sandwich_views_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
  def index
    @my_sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients"
---
  def show
    @my_sandwich = Sandwich.find_by(id: params[:id])
    @sandwich_ingredients = @my_sandwich.ingredients
    @total_calories = @sandwich_ingredients.reduce(0.0) do |sum, ingredient|
      sum + ingredient.calories.to_f
    end
      @ingredients = Ingredient.all