week6/w6d1/video-games-tournament-master/app/controllers/api/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    tournaments = Tournament.all